{
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "drop_worst_after": 0,
  "drop_worst_ratio": 0,
  "finetuning_task": "image_captioning",
  "freeze_embedding": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "img_feature_dim": 1540,
  "img_feature_type": "frcnn",
  "img_layer_norm_eps": 1e-12,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_bert": true,
  "label_smoothing": 0,
  "language_model_type": "MLM",
  "layer_norm_eps": 1e-12,
  "loss_type": "classification",
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_contrast_classes": 3,
  "num_hidden_layers": 12,
  "num_labels": 2,
  "output_attentions": false,
  "output_hidden_states": true,
  "pad_token_id": 0,
  "tie_weights": true,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_img_layernorm": 0,
  "vocab_size": 201
}